# E22_Lite-SOD-C-RA_no_piou: Lite-SOD-B + resolution-aware P2 channel allocation.
# Backbone stays unchanged. Detect remains P2/P3/P4/P5.
# GhostConv replacements are inherited from Lite-SOD-B and not expanded.
#
# Important: keep "yolov8s" in the filename so Ultralytics infers scale=s.

version: E22_Lite-SOD-C-RA
nc: 10
scale: s
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-P2 skip
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-P3 skip
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, C2fEMA, [256, 256, 2, True]] # 6-P4 C2f-EMA
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, C2fEMA, [512, 512, 1, True]] # 8-P5 C2f-EMA
  - [-1, 1, SPPF, [1024, 5]] # 9-P5

head:
  # GFPN-lite top-down path: P5 -> P4 -> P3
  - [9, 1, Conv, [384, 1, 1]] # 10-P5 lateral
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11-P5 upsampled to P4
  - [[-1, 6], 1, Concat, [1]] # 12 concat P5_up + backbone P4
  - [-1, 1, Conv, [384, 1, 1]] # 13 fusion 1x1
  - [-1, 1, GhostConv, [384, 3, 1]] # 14-P4 top-down fusion, GhostConv

  - [-1, 1, Conv, [192, 1, 1]] # 15-P4 lateral
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16-P4 upsampled to P3
  - [[-1, 4], 1, Concat, [1]] # 17 concat P4_up + backbone P3
  - [-1, 1, Conv, [192, 1, 1]] # 18 fusion 1x1
  - [-1, 1, GhostConv, [192, 3, 1]] # 19-P3 fused output, GhostConv

  # Bottom-up path with Lite-SOD-B GhostConv replacements.
  - [-1, 1, GhostConv, [192, 3, 2]] # 20 P3 -> P4, GhostConv
  - [[-1, 14, 6], 1, Concat, [1]] # 21 concat bottom-up + top-down P4 + backbone P4
  - [-1, 1, Conv, [384, 1, 1]] # 22 fusion 1x1
  - [-1, 1, GhostConv, [384, 3, 1]] # 23-P4 fused output, GhostConv

  - [-1, 1, GhostConv, [384, 3, 2]] # 24 P4 -> P5, GhostConv
  - [[-1, 10, 9], 1, Concat, [1]] # 25 concat bottom-up + P5 lateral + backbone P5
  - [-1, 1, Conv, [768, 1, 1]] # 26 fusion 1x1
  - [-1, 1, GhostConv, [768, 3, 1]] # 27-P5 fused output, GhostConv

  # P2 high-resolution branch. RA compresses only P2 from 96 to 80.
  - [19, 1, nn.Upsample, [None, 2, "nearest"]] # 28 P3 -> P2
  - [[-1, 2], 1, Concat, [1]] # 29 concat GFPN P2 path + backbone P2 skip
  - [-1, 1, Conv, [80, 1, 1]] # 30 P2 fusion 1x1, RA compressed from 96
  - [-1, 1, Conv, [80, 3, 1]] # 31-P2 fused output, RA compressed from 96

  - [[31, 19, 23, 27], 1, Detect, [nc]] # 32 Detect(P2, P3, P4, P5)
